$ \textbf{SCM.254 Applied Programming and Data Analysis in Python} $

$ \Large \textbf{Session 5: Data Analysis with Pandas} $

### Name: Dan Zheng
### Program: Ningbo

#   --------------------------------

In [4]:
import pandas as pd
from pandas import Series
from pandas import DataFrame

In [3]:
import pandas as pd

## Activity 1: Series

Given the list L = ["Monday","Tuesday","Wednesday","Thursday","Friday","Saturday","Sunday"]:
- Create a Series from list L
- Assign new index names to the items of the list, starting with 1 for Sunday and finishing with 7 for Saturday.
- Change the value associated to index 1 to "The best day of the week!"
------------------

- Create a Series from list L

In [5]:
# Write your code here
obj=Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [10]:
L = Series(["Monday","Tuesday","Wednesday","Thursday","Friday","Saturday","Sunday"])
L

0       Monday
1      Tuesday
2    Wednesday
3     Thursday
4       Friday
5     Saturday
6       Sunday
dtype: object

- Assign new index names to the items of the list, starting with 1 for Sunday and finishing with 7 for Saturday.

In [26]:
# Write your code here
L1=Series(["Monday","Tuesday","Wednesday","Thursday","Friday","Saturday","Sunday"],index=[2,3,4,5,6,7,1])
L1

2       Monday
3      Tuesday
4    Wednesday
5     Thursday
6       Friday
7     Saturday
1       Sunday
dtype: object

- Change the value associated to index 1 to "the best day of the week!"

In [27]:
# Write your code here
L1.index=[2,3,4,5,6,7,1]
L1[1]="the best day of the week"
L1

2                      Monday
3                     Tuesday
4                   Wednesday
5                    Thursday
6                      Friday
7                    Saturday
1    the best day of the week
dtype: object

## Activity 2: DataFrame

Given a time series consisting of demand values for the first semester of 2018 (table below), write a Python code to perform the following tasks: 

| Month | Demand |
|-------|--------|
|  Jan  |   50   |
|  Feb  |   70   |
|  Mar  |   65   |
|  Apr  |   45   |
|  May  |   60   |
|  Jun  |   75   |

- Create a dictionary of the time series (the keys are "month" and "demand")
- Convert the dictionary to a DataFrame
- Add a column to the DataFrame corresponding to the year 
- Convert demand values to a list
------------------------------------

- Create a dictionary of the time series (the keys are "month" and "demand")

In [35]:
# Create a dictionary of the time series (the keys are "month" and "demand")
Time_Series={"Month":["Jan","Feb","Mar","Apr","May","Jun"],"Demand":[50,70,65,45,60,75]}
data=DataFrame(Time_Series)
data

  Month  Demand
0   Jan      50
1   Feb      70
2   Mar      65
3   Apr      45
4   May      60
5   Jun      75

- Convert the dictionary to a DataFrame

In [36]:
# Convert the dictionary to a DataFrame
data=DataFrame(Time_Series)
data

  Month  Demand
0   Jan      50
1   Feb      70
2   Mar      65
3   Apr      45
4   May      60
5   Jun      75

- Add a column to the DataFrame corresponding to the year

In [38]:
# Add a column to the DataFrame corresponding to the year
data["year"]=2018
data

  Month  Demand  year
0   Jan      50  2018
1   Feb      70  2018
2   Mar      65  2018
3   Apr      45  2018
4   May      60  2018
5   Jun      75  2018

In [41]:
data1=data[["year","Month","Demand"]].copy()
data1

   year Month  Demand
0  2018   Jan      50
1  2018   Feb      70
2  2018   Mar      65
3  2018   Apr      45
4  2018   May      60
5  2018   Jun      75

- Convert demand values to a list

In [43]:
# Convert demand values to a list
data["Demand"].tolist()

[50, 70, 65, 45, 60, 75]

## Activity 3: Data loading/exporting

Write a Python program to perform the following operations:
- Read the data from the Excel file: sales_data.xlsx
- View and inspect the data from the sales_data.xlsx file: display the first 10 rows, display the last 10 rows, return the number of rows and columns, and return the column datatypes.
- Save the DataFrame as a CSV file.
--------------------------

- Read the data from the Excel file: sales.xlsx

In [54]:
# Read the data from the Excel file: sales.xlsx
data2=pd.read_excel("D:/MIT/lesson/IAP/Python/Session5/sales_data.xlsx")

- View and inspect the data from the sales.xlsx file: display the first 10 rows, display the last 10 rows, return a tuple with the number of rows and columns, and return the column data types.

In [55]:
# Display the first 10 rows
data2.head(10)

      SKU   Cost  Price  Sales   Dev
0  J41911   6.61  40.78   74.6  53.4
1  J78212  29.93  46.06   55.3  35.2
2  J38113  12.90  31.75   25.9   8.5
3  J87914  24.87  51.11   73.0  47.5
4  J68515  15.13  54.45   46.7  25.3
5  J94616  15.17  47.79   28.9   8.4
6  J60817  15.04  32.99   18.8  16.3
7  J52318  28.52  65.62   61.0  38.6
8  J74419  14.71  53.15   43.2  17.6
9  J97620  17.00  28.41   12.1   9.6

In [56]:
# Display the last 10 rows
data2.tail(10)

       SKU   Cost  Price  Sales   Dev
50  J41261   9.91  32.31    2.8   2.1
51  J18362  29.11  54.74   63.0  16.4
52  J87863   7.28  38.48   44.3  29.7
53  J97864  16.09  27.98   68.8  54.6
54  J81865  23.57  60.81   58.8  27.6
55  J94666   8.69  25.67   81.0  72.4
56  J13867  13.26  27.78   43.9  22.0
57  J15268  23.93  38.24   14.3  13.6
58  J86269  20.33  58.41   17.8   9.1
59  J65170  16.25  26.33   61.7  35.6

In [57]:
# Return a tuple with the number of rows and columns
data2.shape

(60, 5)

In [58]:
# Return the column data types
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 5 columns):
SKU      60 non-null object
Cost     60 non-null float64
Price    60 non-null float64
Sales    60 non-null float64
Dev      60 non-null float64
dtypes: float64(4), object(1)
memory usage: 2.4+ KB

- Save the DataFrame as a CSV file.

In [60]:
# Save the DataFrame as a CSV file.
data2.to_csv("D:/MIT/lesson/IAP/Python/Session5/sales_data.csv")

## Activity 4: Indexing, selection, and filtering

Using the sales_data dataset:
- Create a new column that contains the profit per SKU unit (price minus cost).
- Return the data of the first row using iloc()
- Return the data of the first row using head()
- Return data of just the 'Sales' and 'Dev' columns as a DataFrame
- Return SKUs (rows) for which sales are greater than 50
- Return SKUs (rows) for which sales are greater than 50 AND standard deviation (Dev) is smaller than 20.
- Extra Challenge: Create a new DataFrame of the SKUs (rows) for sales are greater than 50 AND standard deviation (Dev) is smaller than 20, outputting only the "cost" and "price" columns (in one line of code).
----------------------

- Create a new column that contains the profit per SKU unit (price minus cost).

In [64]:
# Create a new column that contains the profit per SKU unit (price minus cost).
data2['profit_per_SKU']=data2['Price']-data2['Cost']
data2.head(2)

      SKU   Cost  Price  Sales   Dev  profit_per_SKU
0  J41911   6.61  40.78   74.6  53.4           34.17
1  J78212  29.93  46.06   55.3  35.2           16.13

- Return the data of the first row using iloc()

In [71]:
# Return the data of the first row using iloc()
data2.iloc[0,:]

SKU               J41911
Cost                6.61
Price              40.78
Sales               74.6
Dev                 53.4
profit_per_SKU     34.17
Name: 0, dtype: object

- Return the data of the first row using head()

In [72]:
# Return the data of the first row using head()
data2.head(0)

Empty DataFrame
Columns: [SKU, Cost, Price, Sales, Dev, profit_per_SKU]
Index: []

- Return data of just the 'Sales' and 'Dev' columns as a DataFrame

In [76]:
# Return data of just the 'Sales' and 'Dev' columns as a DataFrame
data2[['Sales','Dev']]

    Sales   Dev
0    74.6  53.4
1    55.3  35.2
2    25.9   8.5
3    73.0  47.5
4    46.7  25.3
5    28.9   8.4
6    18.8  16.3
7    61.0  38.6
8    43.2  17.6
9    12.1   9.6
10   81.6  31.8
11   28.9   7.8
12   38.8  27.2
13   31.4  24.9
14   18.5  16.1
15   56.3  22.7
16   59.7  17.4
17   82.5  73.0
18   49.5  29.6
19   76.9  51.8
20   32.7  29.7
21   36.6  17.5
22   11.3   5.7
23   26.6   7.3
24   45.6   5.6
25   17.2   7.3
26   49.3  29.6
27   39.5  13.7
28   82.1  59.3
29   60.4  33.0
30   51.1  25.0
31   52.8  11.3
32   41.9  10.8
33   38.0  26.4
34   16.1   6.4
35   73.9  37.0
36   13.9   8.6
37   49.1  10.2
38   45.6  31.4
39   43.7   5.0
40   66.3  41.0
41   74.6  53.3
42   77.7  75.5
43   30.0  24.3
44   68.7  41.1
45   13.7   3.7
46    2.1   1.5
47   65.7  47.5
48   28.3  16.0
49   55.2   7.8
50    2.8   2.1
51   63.0  16.4
52   44.3  29.7
53   68.8  54.6
54   58.8  27.6
55   81.0  72.4
56   43.9  22.0
57   14.3  13.6
58   17.8   9.1
59   61.7  35.6

- Return SKUs (rows) for which sales are greater than 50

In [83]:
# Return SKUs (rows) for which sales are greater than 50
data3=data2[data2['Sales']>50]
data3['SKU']

0     J41911
1     J78212
3     J87914
7     J52318
10    J21621
15    J74826
16    J55827
17    J67528
19    J15530
28    J33239
29    J51840
30    J85641
31    J36042
35    J21546
40    J81851
41    J17752
42    J19853
44    J78555
47    J18958
49    J59860
51    J18362
53    J97864
54    J81865
55    J94666
59    J65170
Name: SKU, dtype: object

- Return SKUs (rows) for which sales are greater than 50 AND standard deviation (Dev) is smaller than 20.

In [88]:
# Return SKUs (rows) for which sales are greater than 50 AND standard deviation (Dev) is smaller than 20.
data4=data2[(data2['Sales']>50)&(data2['Dev']<20)]
data4

       SKU   Cost  Price  Sales   Dev  profit_per_SKU
16  J55827  15.63  35.08   59.7  17.4           19.45
31  J36042  28.16  45.34   52.8  11.3           17.18
49  J59860  10.07  23.73   55.2   7.8           13.66
51  J18362  29.11  54.74   63.0  16.4           25.63

- Extra Challenge: In one line of code, create a new DataFrame of the SKUs (rows) for sales are greater than 50 AND standard deviation (Dev) is smaller than 20, outputting only the "cost" and "price" columns.

In [87]:
# In one line of code, create a new DataFrame of the SKUs (rows) for sales are greater than 50 AND 
# standard deviation (Dev) is smaller than 20, outputting only the "cost" and "price" columns.
data4[['Cost','Price']]

     Cost  Price
16  15.63  35.08
31  28.16  45.34
49  10.07  23.73
51  29.11  54.74

## Activity 5: Sorting and ranking

Using the sales dataset:
- Sort the SKUs (rows) by sales in descending order
- Delete the column 'Profit' in one line of code 
- Display the first ten rows of the data set
---------------

- Sort the SKUs (rows) by sales in descending order

In [36]:
# Sort the SKUs (rows) by sales in descending order

- Delete the column 'profit' in one line of code

In [ ]:
# Delete the column 'profit' in one line of code

- Display the first ten rows of the data set

In [37]:
# Display the first ten rows of the data set

## Activity 6: Computing descriptive statistics

Write a Python code to do the following:
- Count the number of SKUs
- Caculate total sales (sum all sales)
- Find the average price
- Return the SKU with the highest cost (in one line of code)
- Return the SKU with the lowest price (in one line of code)
--------------

- Count the number of SKUs

In [38]:
# Count the number of SKUs

- Caculate total sales (sum all sales)

In [39]:
# Caculate total sales (sum all sales)

- Find the average price

In [40]:
# Find the average price

- Return the index of the row with the highest cost (in one line of code)

In [41]:
# Return the index of the row with the highest cost (in one line of code)

- Return the index of the row with the lowest price (in one line of code)

In [42]:
# Return the index of the row with the lowest cost (in one line of code)

- Return the SKU with the lowest price (in one line of code)

In [43]:
# Return the SKU with the lowest price (in one line of code)

#   --------------------------------

# Problem 5

HSBD Bank has hired Mario, a data analyst, to do some data analysis to help the company to better understand the customers' demographic characteristics. The upper management has some questions, and Mario must find the answer by analyzing the data available. 

To start, please run the cell below to get the data provided by the bank (<u>it might take a few seconds to finish running</u>).

In [11]:
# Run this cell but DO NOT MODIFY
# Do not modify this part, it belongs to the question
#------------------------------------------------------------------------------------------------------------------
import pandas as pd
url='https://raw.githubusercontent.com/juliencohensolal/BankMarketing/master/rawData/bank-additional-full.csv'
data = pd.read_csv(url,sep=";") # use sep="," for coma separation. 
Age = data['age']
data = data[['age', 'job', 'marital']].copy()
#------------------------------------------------------------------------------------------------------------------

## 5.1

The series *Age* (defined in the cell above) contains information about the customers' age.

Write a script that prints the customers' age every 5,000th customers. This means printing the value associated to the 5,000th element in the series, the 10,000th element, the 15,000th element, and so on.

<b>Tip: Use a loop.</b>

<hr>

The output should have the following format:

The age of the 5000 th customer is 44

The age of the 10000 th customer is 28

The age of the 15000 th customer is 34

...etc...

In [44]:
# Write your script for 5.1 here

## 5.2

The dataframe *data* (defined in the cell above) contains information regarding customers' age, job, and marital status. 

- Print the name of all the columns in the dataframe
- Print the shape of the dataframe to understand the size of *data*
- In one line of code, print the average, the median, the maximum and the minimum age of the customers

In [46]:
# Print the name of all the columns in the dataframe

# Print the shape of the dataframe to understand the size of data

# In one line of code, print the average, the median, the maximum and the minimum age of the customers.

## 5.3

- Using the maximum age of the customers, create a new column called normalized_age that contains the age of each customer divided by the maximum age.
- Print the job information for all customers between index 500 and index 515 (including 500 and 515).
- Delete the marital column from the dataframe 
- Dave the dataframe as an excel file to your local computer and name it Problem5.

<u>Upload both this Jupyter notebook and the excel file you just saved to Stellar.</u>

In [47]:
# Create a new column called normalized_age that contains the age of each customer divided by the maximum age.

# Print the job information for all customers between index 500 and index 515 (including 500 and 515).

# Delete the marital column from the dataframe

# Save the dataframe as an excel file to your local computer and name it Problem5.